/*
变量的命名规范：
命名是什么意思？说白了就是给一个变量起个名字。

规则是什么意思？规则可以这样理解，规定、规则以及约定。
规定和规则必须一定遵守，否则报错。 强制性的
约定尽量遵守，也可以不遵守，但是推荐遵守，因为大家都遵守。可选择的。

变量名称不能以数字开头，比如：123456 就不符合规定。
变量名称不能含有除_下划线以外的任何字符（变量如果要包含符号的话 只能包含_下划线）
那哪些符合规定呢？
- 全字母（不区分大小写）（也可以包含下划线） 比如：abcd  a_b_c_d 等等
- 以_开头后面可以是数字、字母 比如：_123 _abc _a_b_c 等等
那有哪些约定呢？（官方建议这样做，但是也不是必须的）
- 变量名要有实际意义，让阅读者可以更快理解这个变量是放什么东西的。比如，我现在有一个盒子 我想放姓名 那么按照约定 应该给这个变量命名为name。
- 如果变量名是由多个英语单词组成的，那么首字母小写，往后每个单词首字母大写（俗称小驼峰命名规范）。 比如：myName、yourAge。

小驼峰：myRealName
大驼峰：MyRealName

变量的数据类型：
我们这样理解，就是有一个盒子（这个盒子就是一个变量），实际上，这个盒子需要标记是放什么东西的。这就是我们说的变量的数据类型。
那常见的数据类型有哪些呢？

数值型：就是数字，100 2.78 ......
-
int 整型（就是代表整数） 比如：55 100 -200
float64 浮点型（就是代表小数） 比如：100.0 200.20 0.258585858

字符串型：
string 字符串

具体应用场景：

1. 我现在有一个盒子，需要放老师的钢笔，那么该怎么命名呢？  teacherPen
2. 我现在有一个盒子，需要放学生的书，那么该怎么命名呢？    studentBook
3. 我现在有一个盒子，需要放奶奶的眼睛，那么该怎么命名呢？  grandmaGlass

*/

package main

import "fmt"

func main() {
	fmt.Println()
}
